<template>
    <div>
       <scroll class="content" >
           <ul>
               <li>个人信息介绍001</li>
               <li>个人信息介绍002</li>
               <li>个人信息介绍003</li>
               <li>个人信息介绍004</li>
               <li>个人信息介绍005</li>
               <li>个人信息介绍006</li>
               <li>个人信息介绍007</li>
               <li>个人信息介绍008</li>
               <li>个人信息介绍009</li>
               <li>个人信息介绍010</li>
               <li>个人信息介绍011</li>
               <li>个人信息介绍012</li>
               <li>个人信息介绍013</li>
               <li>个人信息介绍014</li>
               <li>个人信息介绍015</li>
               <li>个人信息介绍016</li>
               <li>个人信息介绍017</li>
               <li>个人信息介绍018</li>
               <li>个人信息介绍019</li>
               <li>个人信息介绍020</li>
               <li>个人信息介绍021</li>
               <li>个人信息介绍022</li>
               <li>个人信息介绍023</li>
               <li>个人信息介绍024</li>
               <li>个人信息介绍025</li>
               <li>个人信息介绍026</li>
               <li>个人信息介绍027</li>
               <li>个人信息介绍028</li>
               <li>个人信息介绍029</li>
               <li>个人信息介绍030</li>
               <li>个人信息介绍031</li>
               <li>个人信息介绍032</li>
               <li>个人信息介绍033</li>
               <li>个人信息介绍034</li>
               <li>个人信息介绍035</li>
               <li>个人信息介绍036</li>
               <li>个人信息介绍037</li>
               <li>个人信息介绍038</li>
               <li>个人信息介绍039</li>
               <li>个人信息介绍040</li>
               <li>个人信息介绍041</li>
               <li>个人信息介绍042</li>
               <li>个人信息介绍043</li>
               <li>个人信息介绍044</li>
               <li>个人信息介绍045</li>
               <li>个人信息介绍046</li>
               <li>个人信息介绍047</li>
               <li>个人信息介绍048</li>
               <li>个人信息介绍049</li>
               <li>个人信息介绍050</li>
               <li>个人信息介绍051</li>
               <li>个人信息介绍052</li>
               <li>个人信息介绍053</li>
               <li>个人信息介绍054</li>
               <li>个人信息介绍055</li>
               <li>个人信息介绍056</li>
               <li>个人信息介绍057</li>
               <li>个人信息介绍058</li>
               <li>个人信息介绍059</li>
               <li>个人信息介绍060</li>
               <li>个人信息介绍061</li>
               <li>个人信息介绍062</li>
               <li>个人信息介绍063</li>
               <li>个人信息介绍064</li>
               <li>个人信息介绍065</li>
               <li>个人信息介绍066</li>
               <li>个人信息介绍067</li>
               <li>个人信息介绍068</li>
               <li>个人信息介绍069</li>
               <li>个人信息介绍070</li>
               <li>个人信息介绍071</li>
               <li>个人信息介绍072</li>
               <li>个人信息介绍073</li>
               <li>个人信息介绍074</li>
               <li>个人信息介绍075</li>
               <li>个人信息介绍076</li>
               <li>个人信息介绍077</li>
               <li>个人信息介绍078</li>
               <li>个人信息介绍079</li>
               <li>个人信息介绍080</li>
               <li>个人信息介绍081</li>
               <li>个人信息介绍082</li>
               <li>个人信息介绍083</li>
               <li>个人信息介绍084</li>
               <li>个人信息介绍085</li>
               <li>个人信息介绍086</li>
               <li>个人信息介绍087</li>
               <li>个人信息介绍088</li>
               <li>个人信息介绍089</li>
               <li>个人信息介绍090</li>
               <li>个人信息介绍091</li>
               <li>个人信息介绍092</li>
               <li>个人信息介绍093</li>
               <li>个人信息介绍094</li>
               <li>个人信息介绍095</li>
               <li>个人信息介绍096</li>
               <li>个人信息介绍097</li>
               <li>个人信息介绍098</li>
               <li>个人信息介绍099</li>
               <li>个人信息介绍100</li>
           </ul>
       </scroll>
    </div>
</template>

<script>
import Scroll from "../../components/common/scroll/Scroll.vue"
export default {
    data() {
        return {
            
        };
    },

    mounted() {
        
    },

    methods: {
        
    },
    components:{
        Scroll
    }
};
</script>

<style  scoped>
.content{
    height: 500px;
    background-color: red;
    overflow: hidden;
}

</style>